src/cf/DataProcessors/ОбработчикиВыгрузкиВУправлениеНебольшойФирмой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ОбработчикиВыгрузкиВУправлениеНебольшойФирмой</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаРаботником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийПриход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПродажиИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаРаботником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыПоВедомостям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДепонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗаработнойПлатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДепонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ОбработчикиВыгрузкиВУправлениеНебольшойФирмой/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Обработчики выгрузки конвертации БухгалтерияПредприятия --> УправлениеНебольшойФирмой {4a737118-389c-11e2-a44e-00055d4ef1e7}                                                                      
// 
// Данный модуль содержит экспортные процедуры обработчиков событий конвертации 
// и предназначен для отладки правил обмена. После отладки рекомендуется
// скопировать текст модуля в буфер обмена и импортировать его в базу
// "Конвертация данных".
//
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛЬЗУЕМЫЕ СОКРАЩЕНИЯ ИМЕН ПЕРЕМЕННЫХ (АББРЕВИАТУРЫ)
//
//  ПКО  - правило конвертации объектов
//  ПКС  - правило конвертации свойств объектов
//  ПКГС - правило конвертации группы свойств объектов
//  ПВД  - правило выгрузки данных
//  ПОД  - правило очистки данных

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБРАБОТКИ
// Данный раздел изменять запрещено.

Перем Параметры;
Перем Алгоритмы;
Перем Запросы;
Перем УзелДляОбмена;
Перем ОбщиеПроцедурыФункции;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ (ГЛОБАЛЬНЫЕ)
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКО_СтруктурныеЕдиницы_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	Если Источник.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКС_БанковскиеСчета_ВсегдаУказыватьКПП_ПередВыгрузкойСвойства_16_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = ?(Источник.ВсегдаУказыватьКПП, "Перечисления.ВариантыУказанияКПП.ВоВсехПлатежныхПоручениях","Перечисления.ВариантыУказанияКПП.ПриПеречисленииНалогов");

КонецПроцедуры

Процедура ПКС_БанковскиеСчета_МесяцПрописью_ПередВыгрузкойСвойства_17_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = ?(Источник.МесяцПрописью, "Перечисления.ВариантыВыводаМесяцаВДатеДокумента.Прописью","Перечисления.ВариантыВыводаМесяцаВДатеДокумента.Числом");

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_Родитель_ПередВыгрузкойСвойства_7_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Пусто = Истина;

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_СрокОплаты_ПередВыгрузкойСвойства_9_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	
	Если Источник.УстановленСрокОплаты
		И (Источник.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		ИЛИ Источник.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером) Тогда
		
		Значение = Источник.СрокОплаты;
	Иначе
		Значение = 0;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ДоговорыКонтрагентов_СрокОплаты_ПередВыгрузкойСвойства_14_20(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	
	Если Источник.УстановленСрокОплаты
		И (Источник.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
		ИЛИ Источник.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
		
		Значение = Источник.СрокОплаты;
	Иначе
		Значение = 0;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Контрагенты_Родитель_ПередВыгрузкойСвойства_3_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.Родитель = Источник.Ссылка Тогда
		Значение = Неопределено;	
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Контрагенты_ВестиРасчетыПоДоговорам_ПередВыгрузкойСвойства_26_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Истина;

КонецПроцедуры

Процедура ПКС_Номенклатура_Родитель_ПередВыгрузкойСвойства_7_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.Родитель = Источник.Ссылка Тогда
		Значение = Неопределено;	
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Номенклатура_СтавкаНДС_ПередВыгрузкойСвойства_8_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ЗаполнитьПараметрСтавкаНДСШапки (Значение, Источник);

КонецПроцедуры

Процедура ПКС_Номенклатура_СпособПополнения_ПередВыгрузкойСвойства_13_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Отказ = Источник.ЭтоГруппа;
	Если НЕ Отказ Тогда
		Выражение = "Перечисления.СпособыПополненияЗапасов.Закупка";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Номенклатура_Услуга_ПередВыгрузкойСвойства_14_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	// Источник.Услуга, тип = NULL либо Булево
	
	Если Источник.Услуга = Истина Тогда
		Выражение = "Перечисления.ТипыНоменклатуры.Услуга";
	Иначе
		Выражение = "Перечисления.ТипыНоменклатуры.Запас";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Номенклатура_МетодОценки_ПередВыгрузкойСвойства_15_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = "Перечисления.МетодОценкиЗапасов.ПоСредней";

КонецПроцедуры

Процедура ПКС_ПлатежноеПоручение_СтавкаНДС_ПередВыгрузкойСвойства_22_18(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ЗаполнитьПараметрСтавкаНДСШапки (Значение, Источник);

КонецПроцедуры

Процедура ПКС_ПлатежноеПоручение_ПеречислениеВБюджет_ПередВыгрузкойСвойства_30_18(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = ?(Источник.ПеречислениеВБюджет, "Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога", "Перечисления.ВидыОперацийПлатежноеПоручение.Оплата");

КонецПроцедуры

Процедура ПКС_Подразделения_ТипСтруктурнойЕдиницы_ПередВыгрузкойСвойства_5_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = "Перечисления.ТипыСтруктурныхЕдиниц.Подразделение";

КонецПроцедуры

Процедура ПКС_ПоступлениеВКассу_Контрагент_ПередВыгрузкойСвойства_4_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации <> Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика
	   И Источник.ВидОперации <> Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
	   Значение = "";
	КонецЕСли;

КонецПроцедуры

Процедура ПКС_ПоступлениеВКассу_РасшифровкаПлатежа_СтавкаНДС_ПередВыгрузкойСвойства_14_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ЗаполнитьПараметрСтавкаНДСТабличнойЧасти (Значение, ОбъектКоллекции);

КонецПроцедуры

Процедура ПКС_ПоступлениеВКассу_СтатьяДвиженияДенежныхСредств_ПередВыгрузкойСвойства_19_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник.СтатьяДвиженияДенежныхСредств)
		  И Источник.РасшифровкаПлатежа.Количество() > 0 Тогда
		Значение = Источник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ПоступлениеВКассу_ФизЛицо_ПередВыгрузкойСвойства_28_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтПодотчетногоЛица
		И ТипЗнч(Источник.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица")
		И ЗначениеЗаполнено(Источник.Контрагент) Тогда
		
		Значение = Источник.Контрагент;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ПоступлениеВКассу_РасшифровкаПлатежа_ПризнакАванса_ПередВыгрузкойСвойства_29_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = НЕ ЗначениеЗаполнено(ОбъектКоллекции.Сделка);

КонецПроцедуры

Процедура ПКС_ПоступлениеВКассу_Корреспонденция_ПередВыгрузкойСвойства_33_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийПКО.ЛичныеСредстваПредпринимателя Тогда 
		Значение = "НераспределеннаяПрибыль";
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ПоступлениеНаСчет_Контрагент_ПередВыгрузкойСвойства_5_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации <> Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика
	   И Источник.ВидОперации <> Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда
	   Значение = "";
	КонецЕСли;

КонецПроцедуры

Процедура ПКС_ПоступлениеНаСчет_РасшифровкаПлатежа_СтавкаНДС_ПередВыгрузкойСвойства_12_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ЗаполнитьПараметрСтавкаНДСТабличнойЧасти (Значение, ОбъектКоллекции);

КонецПроцедуры

Процедура ПКС_ПоступлениеНаСчет_СтатьяДвиженияДенежныхСредств_ПередВыгрузкойСвойства_17_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник.СтатьяДвиженияДенежныхСредств)
		  И Источник.РасшифровкаПлатежа.Количество() > 0 Тогда
		Значение = Источник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ПоступлениеНаСчет_РасшифровкаПлатежа_ПризнакАванса_ПередВыгрузкойСвойства_26_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = НЕ ЗначениеЗаполнено(ОбъектКоллекции.Сделка);

КонецПроцедуры

Процедура ПКС_ПоступлениеНаСчет_Кратность_ПередВыгрузкойСвойства_28_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты
	   И Источник.РасшифровкаПлатежа.Количество() > 0 Тогда
		Значение = Источник.РасшифровкаПлатежа[0].КратностьВзаиморасчетов;
	Иначе
		Значение = 1;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ПоступлениеНаСчет_Курс_ПередВыгрузкойСвойства_29_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты
	   И Источник.РасшифровкаПлатежа.Количество() > 0 Тогда
		Значение = Источник.РасшифровкаПлатежа[0].КурсВзаиморасчетов;
	Иначе
		Значение = 1;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ПоступлениеНаСчет_Корреспонденция_ПередВыгрузкойСвойства_32_17(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ЛичныеСредстваПредпринимателя Тогда 
		Значение = "НераспределеннаяПрибыль";
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ПриходныйКассовыйОрдерПеремещениеДС_ТипДенежныхСредств_ПередВыгрузкойСвойства_12_35(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "Безналичные";

КонецПроцедуры

Процедура ПКС_ПриходныйКассовыйОрдерПеремещениеДС_ТипДенежныхСредствПолучатель_ПередВыгрузкойСвойства_13_35(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "Наличные";

КонецПроцедуры

Процедура ПКС_РасходИзКассы_Контрагент_ПередВыгрузкойСвойства_5_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации <> Перечисления.ВидыОперацийРКО.ВозвратПокупателю
	   И Источник.ВидОперации <> Перечисления.ВидыОперацийРКО.ОплатаПоставщику Тогда
	   Значение = "";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходИзКассы_РасшифровкаПлатежа_СтавкаНДС_ПередВыгрузкойСвойства_16_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ЗаполнитьПараметрСтавкаНДСТабличнойЧасти (Значение, ОбъектКоллекции);

КонецПроцедуры

Процедура ПКС_РасходИзКассы_СтатьяДвиженияДенежныхСредств_ПередВыгрузкойСвойства_20_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник.СтатьяДвиженияДенежныхСредств)
		  И Источник.РасшифровкаПлатежа.Количество() > 0 Тогда
		Значение = Источник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходИзКассы_ФизЛицо_ПередВыгрузкойСвойства_30_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если (Источник.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу
		ИЛИ Источник.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику)
		И ТипЗнч(Источник.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица")
		И ЗначениеЗаполнено(Источник.Контрагент) Тогда
		
		Значение = Источник.Контрагент;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходИзКассы_РасшифровкаПлатежа_ПризнакАванса_ПередВыгрузкойСвойства_31_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = НЕ ЗначениеЗаполнено(ОбъектКоллекции.Сделка);

КонецПроцедуры

Процедура ПКС_РасходИзКассы_Корреспонденция_ПередВыгрузкойСвойства_36_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийРКО.ЛичныеСредстваПредпринимателя Тогда 
		Значение = "НераспределеннаяПрибыль";
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходныйКассовыйОрдерПеремещениеДС_ТипДенежныхСредств_ПередВыгрузкойСвойства_13_35(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "Наличные";

КонецПроцедуры

Процедура ПКС_РасходныйКассовыйОрдерПеремещениеДС_ТипДенежныхСредствПолучатель_ПередВыгрузкойСвойства_14_35(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "Безналичные";

КонецПроцедуры

Процедура ПКС_РасходСоСчета_Контрагент_ПередВыгрузкойСвойства_4_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю
	   И Источник.ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
	   Значение = "";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходСоСчета_СтатьяДвиженияДенежныхСредств_ПередВыгрузкойСвойства_15_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник.СтатьяДвиженияДенежныхСредств)
		  И Источник.РасшифровкаПлатежа.Количество() > 0 Тогда
		Значение = Источник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходСоСчета_ФизЛицо_ПередВыгрузкойСвойства_21_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеПодотчетномуЛицу
		И ТипЗнч(Источник.ФизЛицо) = Тип("СправочникСсылка.ФизическиеЛица")
		И ЗначениеЗаполнено(Источник.ФизЛицо) Тогда
		
		Значение = Источник.ФизЛицо;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходСоСчета_РасшифровкаПлатежа_ПризнакАванса_ПередВыгрузкойСвойства_24_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = НЕ ЗначениеЗаполнено(ОбъектКоллекции.Сделка);

КонецПроцедуры

Процедура ПКС_РасходСоСчета_РасшифровкаПлатежа_СтавкаНДС_ПередВыгрузкойСвойства_25_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ЗаполнитьПараметрСтавкаНДСТабличнойЧасти (Значение, ОбъектКоллекции);

КонецПроцедуры

Процедура ПКС_РасходСоСчета_ВидНалогаСтрока_ПередВыгрузкойСвойства_31_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога Тогда
	
		Если Источник.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НДФЛ Тогда
			ВидНалогаСтрока = "Налог на доходы";
		ИначеЕсли Источник.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НДС Тогда
			ВидНалогаСтрока = "НДС";
		ИначеЕсли Источник.СчетУчетаРасчетовСКонтрагентом.Родитель = ПланыСчетов.Хозрасчетный.НалогНаПрибыль Тогда
			ВидНалогаСтрока = "Налог на прибыль";
		ИначеЕсли Найти(Источник.СчетУчетаРасчетовСКонтрагентом.Код, "69") Тогда
			ВидНалогаСтрока = "ЕСН";
		Иначе
			ВидНалогаСтрока = "Прочие налоги и сборы";
		КонецЕсли;
		
		Значение = ВидНалогаСтрока;
	Иначе
		Пусто = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_РасходСоСчета_Корреспонденция_ПередВыгрузкойСвойства_32_13(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ЛичныеСредстваПредпринимателя Тогда 
		Значение = "НераспределеннаяПрибыль";
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Спецификации_ИсходныеКомплектующие_КоличествоПродукции_ПередВыгрузкойСвойства_8_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Источник.Количество;

КонецПроцедуры

Процедура ПКС_Спецификации_ИсходныеКомплектующие_ТипСтрокиСостава_ПередВыгрузкойСвойства_9_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = "Перечисления.ТипыСтрокСоставаСпецификации.Материал";

КонецПроцедуры

Процедура ПКС_Спецификации_ИсходныеКомплектующие_ДоляСтоимости_ПередВыгрузкойСвойства_10_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = 1;

КонецПроцедуры

Процедура ПКС_СписаниеСРасчетногоСчетаПеремещениеДС_ТипДенежныхСредств_ПередВыгрузкойСвойства_13_37(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "Безналичные";

КонецПроцедуры

Процедура ПКС_СписаниеСРасчетногоСчетаПеремещениеДС_ТипДенежныхСредствПолучатель_ПередВыгрузкойСвойства_14_37(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "Безналичные";

КонецПроцедуры

Процедура ПКС_СтруктурныеЕдиницы_Родитель_ПередВыгрузкойСвойства_4_18(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Пусто = Истина;

КонецПроцедуры

Процедура ПКС_СтруктурныеЕдиницы_МОЛ_ПередВыгрузкойСвойства_6_18(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Отбор = Новый Структура("СтруктурнаяЕдиница");
	Отбор.СтруктурнаяЕдиница = Источник.Ссылка;
	СрезПоследних = РегистрыСведений.ОтветственныеЛица.СрезПоследних(ТекущаяДата(), Отбор);
	
	Значение = ?(СрезПоследних.Количество() > 1, СрезПоследних[0].ФизическоеЛицо, Неопределено);

КонецПроцедуры

Процедура ПКС_СтруктурныеЕдиницы_СчетУчетаВРознице_ПередВыгрузкойСвойства_8_18(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = "ПланыСчетов.Управленческий.ТоварыПродукция";

КонецПроцедуры

Процедура ПКС_СтруктурныеЕдиницы_СчетУчетаНаценки_ПередВыгрузкойСвойства_9_18(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Выражение = "ПланыСчетов.Управленческий.ТорговаяНаценка";

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ГРУПП СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКГС_Контрагенты_КонтактнаяИнформация_ПередОбработкойВыгрузки_13_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа = Истина Тогда
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПКГС_Организации_КонтактнаяИнформация_ПередОбработкойВыгрузки_14_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа = Истина Тогда
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПКГС_ФизическиеЛица_КонтактнаяИнформация_ПередОбработкойВыгрузки_8_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа = Истина Тогда
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ВЫГРУЗКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПВД_ДоговорыКонтрагентов_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если Объект.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПВД_НоменклатурныеГруппы_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если Объект.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПВД_ПриходныйКассовыйОрдер_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке Тогда
		ИмяПКО = "ПриходныйКассовыйОрдерПеремещениеДС";
	Иначе
		ИмяПКО = "ПоступлениеВКассу";
	КонецЕсли;

КонецПроцедуры

Процедура ПВД_РасходныйКассовыйОрдер_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
		ИмяПКО = "РасходныйКассовыйОрдерПеремещениеДС";
	Иначе
		ИмяПКО = "РасходИзКассы";
	КонецЕсли;

КонецПроцедуры

Процедура ПВД_СпецификацииНоменклатуры_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если Объект.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПВД_СписаниеСРасчетногоСчета_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет Тогда
		ИмяПКО = "СписаниеСРасчетногоСчетаПеремещениеДС";
	Иначе
		ИмяПКО = "РасходСоСчета";
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЧИСТКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПАРАМЕТРОВ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// АЛГОРИТМЫ
// Данный раздел разрешено изменять.
// Также допустимо размещать процедуры с алгоритмами в любом из разделов выше.

Процедура ЗаполнитьПараметрСтавкаНДСТабличнойЧасти(Значение, ОбъектКоллекции) Экспорт

	Если ОбъектКоллекции.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Значение =
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 18
		|	И НЕ СтавкиНДС.НеОблагается
		|	И НЕ СтавкиНДС.Расчетная";
	ИначеЕсли ОбъектКоллекции.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 18
		|	И НЕ СтавкиНДС.НеОблагается
		|	И СтавкиНДС.Расчетная";
	ИначеЕсли ОбъектКоллекции.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 10
		|	И НЕ СтавкиНДС.НеОблагается
		|	И НЕ СтавкиНДС.Расчетная";
	ИначеЕсли ОбъектКоллекции.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Значение =
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 10
		|	И НЕ СтавкиНДС.НеОблагается
		|	И СтавкиНДС.Расчетная";
	ИначеЕсли ОбъектКоллекции.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 0
		|	И НЕ СтавкиНДС.НеОблагается";
	ИначеЕсли ОбъектКоллекции.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 20
		|	И НЕ СтавкиНДС.НеОблагается
		|	И НЕ СтавкиНДС.Расчетная";
	ИначеЕсли ОбъектКоллекции.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 20
		|	И НЕ СтавкиНДС.НеОблагается
		|	И СтавкиНДС.Расчетная";	
	Иначе
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.НеОблагается";
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПараметрСтавкаНДСШапки(Значение, Источник) Экспорт

	Если Источник.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Значение =
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 18
		|	И НЕ СтавкиНДС.НеОблагается
		|	И НЕ СтавкиНДС.Расчетная";
	ИначеЕсли Источник.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 18
		|	И НЕ СтавкиНДС.НеОблагается
		|	И СтавкиНДС.Расчетная";
	ИначеЕсли Источник.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 10
		|	И НЕ СтавкиНДС.НеОблагается
		|	И НЕ СтавкиНДС.Расчетная";
	ИначеЕсли Источник.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Значение =
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 10
		|	И НЕ СтавкиНДС.НеОблагается
		|	И СтавкиНДС.Расчетная";
	ИначеЕсли Источник.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 0
		|	И НЕ СтавкиНДС.НеОблагается";
	ИначеЕсли Источник.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 20
		|	И НЕ СтавкиНДС.НеОблагается
		|	И НЕ СтавкиНДС.Расчетная";
	ИначеЕсли Источник.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 20
		|	И НЕ СтавкиНДС.НеОблагается
		|	И СтавкиНДС.Расчетная";	
	Иначе
		Значение = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК СтавкаНДС
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.НеОблагается";
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьСтруктуруДоговораКонтрагента(Источник, ОбъектКоллекции, Значение) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Данный раздел изменять запрещено.

// Служебная. Инициализирует переменные, необходимые для отладки
//
// Параметры:
//  Владелец - Обработка КонвертацияОбъектовИнформационныхБаз
//
Процедура ПодключитьОбработкуДляОтладки(Владелец) Экспорт

	Параметры            	 = Владелец.Параметры;
	ОбщиеПроцедурыФункции	 = Владелец;
	Запросы              	 = Владелец.Запросы;
	УзелДляОбмена		 	 = Владелец.УзелДляОбмена;

КонецПроцедуры

#КонецЕсли
